In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./Sets/titanic_train.csv')

# Selección y slicing

##  iloc  
Funciona con posición!

In [3]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Si sabes cómo se llama la columna, pero no sabes qué posición tiene, puedes usar este pedacito de código.

In [4]:
df.columns.tolist().index('Name')

3

df.iloc[RENGLON, COLUMNA]

In [5]:
df.iloc[0,3]

'Braund, Mr. Owen Harris'

In [6]:
df.iloc[4,3]

'Allen, Mr. William Henry'

Slicing. Dame los renglones del 0 al 5, límite superior no inclusive. (O sea, los renglones 0, 1, 2, 3, 4) y la columna no. 3 (el nombre)

In [7]:
df.iloc[0:5,3]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

Los últimos 5 y la columna no. 3 (el nombre)

In [8]:
df.iloc[-5:,3]

886                       Montvila, Rev. Juozas
887                Graham, Miss. Margaret Edith
888    Johnston, Miss. Catherine Helen "Carrie"
889                       Behr, Mr. Karl Howell
890                         Dooley, Mr. Patrick
Name: Name, dtype: object

Una lista de renglones y la columna no. 3 (el nombre)

In [9]:
df.iloc[[0,2,4,6],3]

0     Braund, Mr. Owen Harris
2      Heikkinen, Miss. Laina
4    Allen, Mr. William Henry
6     McCarthy, Mr. Timothy J
Name: Name, dtype: object

Todos los renglones y la columna no. 3 (el nombre) (voy a dejar de escribir lo de la columna...)

In [10]:
df.iloc[:,3]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

Todos los renglones y todas las columnas

In [11]:
df.iloc[:,:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Todos los renglones y las columnas del 3 a la 8va límite superior no inclusive (o sea columnas 3, 4, 5, 6, 7)

In [12]:
df.iloc[:,3:8]

,Name,Sex,Age,SibSp,Parch
0,"Braund, Mr. Owen Harris",male,22.0,1,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0
2,"Heikkinen, Miss. Laina",female,26.0,0,0
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0
4,"Allen, Mr. William Henry",male,35.0,0,0
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.0,0,0
887,"Graham, Miss. Margaret Edith",female,19.0,0,0
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2
889,"Behr, Mr. Karl Howell",male,26.0,0,0
890,"Dooley, Mr. Patrick",male,32.0,0,0

## loc  
Funciona con *etiquetas*

los límites de loc siempre son inclusives

En vez de pasarle la posición la columna Name, sólo le pasamos el nombre

Primer renglón, columna Name

In [13]:
df.loc[0,'Name']

'Braund, Mr. Owen Harris'

Todos los renglones de las columnas entre Name y Parch límites inclusives

In [14]:
df.loc[:,'Name':'Parch']

,Name,Sex,Age,SibSp,Parch
0,"Braund, Mr. Owen Harris",male,22.0,1,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0
2,"Heikkinen, Miss. Laina",female,26.0,0,0
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0
4,"Allen, Mr. William Henry",male,35.0,0,0
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.0,0,0
887,"Graham, Miss. Margaret Edith",female,19.0,0,0
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2
889,"Behr, Mr. Karl Howell",male,26.0,0,0
890,"Dooley, Mr. Patrick",male,32.0,0,0

Una lista de renglones con todas las columnas entre Name y Parch límites inclusives

In [15]:
df.loc[[0,2,4,6],'Name':'Parch']

                       Name     Sex   Age  SibSp  Parch
0   Braund, Mr. Owen Harris    male  22.0      1      0
2    Heikkinen, Miss. Laina  female  26.0      0      0
4  Allen, Mr. William Henry    male  35.0      0      0
6   McCarthy, Mr. Timothy J    male  54.0      0      0

Una lista de renglones y una lista de columnas

In [16]:
df.loc[[0,2,4,6],['Name','Parch']]

                       Name  Parch
0   Braund, Mr. Owen Harris      0
2    Heikkinen, Miss. Laina      0
4  Allen, Mr. William Henry      0
6   McCarthy, Mr. Timothy J      0

Ojo, parece que estamos pidiendo la posición 0 del índice (el primer elemento) pero técnicamente lo que está pasando es que loc está buscando el renglón que se llame 0, no el que está en la posición 0. Sutil diferencia.

Para demostrarlo cambiamos el índice a Name

In [17]:
df_nameindex = df.set_index('Name')
df_nameindex.head(3)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

Si usamos iloc[0,:] vamos a obtener todas las columnas del primer renglón

In [18]:
df_nameindex.iloc[0,:]

PassengerId            1
Survived               0
Pclass                 3
Sex                 male
Age                   22
SibSp                  1
Parch                  0
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

Si usamos loc va a tronar porque ningún índice se 'llama' 0

In [19]:
df_nameindex.loc[0,:]

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

Pero podemos usar un nombre con el loc para obtener lo que buscamos

El renglón Braund, Mr Owen Harris, todas las columnas

In [20]:
df_nameindex.loc['Braund, Mr. Owen Harris',:]

PassengerId            1
Survived               0
Pclass                 3
Sex                 male
Age                   22
SibSp                  1
Parch                  0
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

Una lista de renglones y la columna Age

In [21]:
df_nameindex.loc[['Braund, Mr. Owen Harris','Heikkinen, Miss. Laina'],'Age']

Name
Braund, Mr. Owen Harris    22.0
Heikkinen, Miss. Laina     26.0
Name: Age, dtype: float64

Igual, jalan los slices

In [22]:
df_nameindex.loc['Braund, Mr. Owen Harris':'Allen, Mr. William Henry','Age']

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
Allen, Mr. William Henry                               35.0
Name: Age, dtype: float64

## Dot notation vs bracket notation

Son casi equivalentes salvo que la dot notation se ve más limpia y es limitada con respecto a los brackets. Por ejemplo, si hay espacios o caracteres especiales en el nombre de tu columna no lo vas a poder seleccionar con dot notation.

In [23]:
df.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [24]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [25]:
df.loc[:,'Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

## Slicing con booleanos

Todas las instancias de Pclass donde el valor sea 3

In [26]:
df['Pclass'] == 3

0       True
1      False
2       True
3      False
4       True
       ...
886    False
887    False
888     True
889    False
890     True
Name: Pclass, Length: 891, dtype: bool

Guarda todas las instancias donde Pclass sea 3 ó 2. Usa ese arreglo booleano (True significa que el valor es 3 ó 2, Flase significa que no) y regresame todas esas instancias con sus columas correspondientes.

In [27]:
condicion = (df['Pclass'] == 3) | (df['Pclass'] == 2)
df.loc[condicion,:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [28]:
df[(df['Pclass'] == 3) | (df['Pclass'] == 2)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

**Alternativa a .loc y .iloc para accesar columnas. Tiene la ventaja de poder dar un mensaje de error customizado en vez de detener toda la ejecución del código**

In [29]:
df.get('Pclass')

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [30]:
df.get('Columna que no existe', default='La columna que pides no existe')

'La columna que pides no existe'

## Slicing con métodos

In [31]:
#Igual
df['SibSp'].eq(22.0)

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: SibSp, Length: 891, dtype: bool

In [32]:
#Diferente
df['SibSp'].ne(22.0)

0      True
1      True
2      True
3      True
4      True
       ...
886    True
887    True
888    True
889    True
890    True
Name: SibSp, Length: 891, dtype: bool

In [33]:
#Igual o menor
df['SibSp'].le(22.0)

0      True
1      True
2      True
3      True
4      True
       ...
886    True
887    True
888    True
889    True
890    True
Name: SibSp, Length: 891, dtype: bool

In [34]:
#Menor
df['SibSp'].lt(22.0)

0      True
1      True
2      True
3      True
4      True
       ...
886    True
887    True
888    True
889    True
890    True
Name: SibSp, Length: 891, dtype: bool

In [35]:
#Igual o mayor
df['SibSp'].ge(22.0)

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: SibSp, Length: 891, dtype: bool

In [36]:
#Mayor
df['SibSp'].gt(22.0)

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: SibSp, Length: 891, dtype: bool

In [37]:
#Entre dos límites incluyentes
df['SibSp'].between(22.0,22.0)

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: SibSp, Length: 891, dtype: bool

**Estos métodos son equivalentes a su contrapartes pitónicas, o sea, df[col].eq(X) es lo mismo que df[col]==X.**

## at, iat y get_loc

**at, iat**

at hace lo mismo que loc, pero extrae **valores únicos** (no puedes hacer slicing).

es significativamente más rápido que loc

In [51]:
df.at[0,'Name']

'Braund, Mr. Owen Harris'

iat es el equivalente a iloc

In [52]:
df.iat[0,3]

'Braund, Mr. Owen Harris'

**Comparción de velocidad**

In [53]:
%%timeit
df.loc[0,'Name']

6.2 µs ± 65.6 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [54]:
%%timeit
df.at[0,'Name']

3.77 µs ± 63.2 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

**get_loc**

Si quieres la posición de algún índice/columna usa esto

In [56]:
df.columns.get_loc('Name')

3

In [57]:
df.index.get_loc(10)

10

In [59]:
df.set_index('Name').index.get_loc('Panula, Master. Juha Niilo')

50